# Bonus: Temperature Analysis I

In [1]:
import pandas as pd
from datetime import datetime as dt
import scipy.stats as sp

In [2]:
# "tobs" is "temperature observations"
df = pd.read_csv('Resources/hawaii_measurements.csv')
df.head()

       station        date  prcp  tobs
0  USC00519397  2010-01-01  0.08    65
1  USC00519397  2010-01-02  0.00    63
2  USC00519397  2010-01-03  0.00    74
3  USC00519397  2010-01-04  0.00    76
4  USC00519397  2010-01-06   NaN    73

In [3]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19550 entries, 0 to 19549
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   station  19550 non-null  object
 1   date     19550 non-null  object
 2   prcp     18103 non-null  float64
 3   tobs     19550 non-null  int64
dtypes: float64(1), int64(1), object(2)
memory usage: 611.1+ KB
None

In [4]:
# Convert the date column format from string to datetime
df['date'] = pd.to_datetime(df['date'], infer_datetime_format=True) 

# df.info()
# df['date'] = pd.to_datetime(df["date"].dt.strftime('%Y-%m'))
df.head(5)

       station       date  prcp  tobs
0  USC00519397 2010-01-01  0.08    65
1  USC00519397 2010-01-02  0.00    63
2  USC00519397 2010-01-03  0.00    74
3  USC00519397 2010-01-04  0.00    76
4  USC00519397 2010-01-06   NaN    73

In [5]:
# Set the date column as the DataFrame index
df.set_index('date')
df.head(5)

       station       date  prcp  tobs
0  USC00519397 2010-01-01  0.08    65
1  USC00519397 2010-01-02  0.00    63
2  USC00519397 2010-01-03  0.00    74
3  USC00519397 2010-01-04  0.00    76
4  USC00519397 2010-01-06   NaN    73

In [6]:
# Drop the date column
df_temp = df.drop(['station', 'prcp'], axis=1)
df_temp.reset_index(drop=True, inplace=True)
df_temp = df_temp.dropna(how='any',axis=0)
df_temp

            date  tobs
0     2010-01-01    65
1     2010-01-02    63
2     2010-01-03    74
3     2010-01-04    76
4     2010-01-06    73
...          ...   ...
19545 2017-08-19    71
19546 2017-08-20    78
19547 2017-08-21    76
19548 2017-08-22    76
19549 2017-08-23    76

[19550 rows x 2 columns]

### Compare June and December data across all years

In [7]:
from scipy import stats

In [8]:
# Filter data for desired months
# data = [df_temp.date.dt.strftime('%Y-%m')]
# mes=[df_temp.tobs]
headers = ["date", "tobs"]
Jun = df_temp[df_temp.date.dt.month.isin([6])]
data = [Jun.date.dt.strftime('%Y-%m'), Jun['tobs']]
date_tobs_06 = pd.concat(data, axis=1, keys=headers)
date_tobs_jun = date_tobs_06.groupby('date').mean()
date_tobs_jun

              tobs
date
2010-06  74.925620
2011-06  73.938326
2012-06  74.000000
2013-06  74.599078
2014-06  75.027907
2015-06  74.990148
2016-06  75.175258
2017-06  77.219895

In [9]:
Dec = df_temp[df_temp.date.dt.month == 12]
data1 = [Dec.date.dt.strftime('%Y-%m'), Dec['tobs']]
date_tobs_12 = pd.concat(data1, axis=1, keys=headers)
date_tobs_Dec = date_tobs_12.groupby('date').mean()

date_tobs_Dec

              tobs
date
2010-12  70.208511
2011-12  70.820628
2012-12  71.188073
2013-12  71.094017
2014-12  69.896861
2015-12  73.423913
2016-12  71.130000

In [10]:
# Identify the average temperature for June
jun_mean = date_tobs_jun.mean()
jun_mean
print(f'The avegare temperature fro June is: {round(jun_mean[0],2)}')

The avegare temperature fro June is: 74.98

In [11]:
# Identify the average temperature for December
dec_mean = date_tobs_Dec.mean()
print(f'The avegare temperature for December is: {round(dec_mean[0],2)}')

The avegare temperature for December is: 71.11

In [12]:
headers = ["Jun", "Dec"]
data = [date_tobs_jun['tobs'], date_tobs_Dec['tobs']]
date_tobs_ = pd.concat(data, axis=1, keys=headers)
date_tobs_.describe()

             Jun        Dec
count   8.000000   7.000000
mean   74.984529  71.108858
std     1.017773   1.134979
min    73.938326  69.896861
25%    74.449309  70.514569
50%    74.957884  71.094017
75%    75.064745  71.159037
max    77.219895  73.423913

In [13]:
# Create collections of temperature data
jun06 = date_tobs_jun['tobs'].to_list()
dec12 = date_tobs_Dec['tobs'].to_list()

In [16]:
# Run paired t-test
t, p = sp.ttest_ind(jun06, dec12,, equal_var=False)
p = "{:.10f}".format(p)
print(f"t: {t}    p: {p}")

SyntaxError: invalid syntax (<ipython-input-16-39aa0b4a15db>, line 2)

### Analysis

In [15]:
#  Use the t-test to determine whether the difference in the means, if any, is statistically significant.
# Will you use a paired t-test, or an unpaired t-test? Why?

print(f'I would use paired t-test because we are comparing the same subject (temperature) at two different times')
print(f'I also used the parameter equal_var = false, because the data arrays month are not the same size')
print(f'since the p-value is less than 0.03, P ≤ 0.03, This means that there is a low probability \
of finding a considerable difference in the observed temperatures.')

I would use paired t-test because we are comparing the same subject (temperature) at two different times
I also used the parameter equal_var = false, because the data arrays month are not the same size
since the p-value is less than 0.03, P ≤ 0.03, This means that there is a low probability of finding a considerable difference in the observed temperatures.